#!/usr/bin/env python
# encoding: utf-8

"""
@description: 北京地铁

@author: baoqiang
@time: 2019-05-24 16:40
"""

"""
已通车 -> 22
2022年前通车 -> 8
2035年规划 -> 0
"""

"""
18: 跟一号线一样
20: 两大机场联络线内环
21: 两大机场联络线外环
23: 东南，永乐新城
24: 
26:
28: 西边南北贯通
29: 南边四五环之间
30: 东北线
31: 北清路连接线
"""

"""
北京16区：
西城区，东城区
海淀区，朝阳区，丰台区，石景山区
大兴区，顺义区，昌平区，通州区
房山区，怀柔区，密云区，平谷区，门头沟区，延庆区
"""

"""
目前没通地铁的4个区：
怀柔区，密云区，平谷区，延庆区
"""

subways = {
    '已通车': [1, 2, 4, 5, 6, 7, 8, 9, 10, 13, 14, 15, 16,
            "亦庄线", "27(昌平线)", "25(房山线)", "燕房线", "八通线", "西郊线", "大兴线", "机场线", "S1线(门头沟线)", ],
    '2022年前通车': [3, 11, 12, 17, 19, 28, "22(平谷线)", "新机场线"],
    '2035年规划': [],
}


def get_subway():
    for k, subs in subways.items():
        print('{} -> {}'.format(k, len(subs)))


if __name__ == '__main__':
    get_subway()
